from datetime import datetime
from create_bot import DB

"""В модуле содержатся переменные для работы бота, токен содержится в файле TOKEN.py"""

current_year = datetime.now().year
current_month = datetime.now().month
current_day = datetime.now().day

days_array = ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12',
              '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24',
              '25', '26', '27', '28', '29', '30', '31']
callback_for_days = ['d01', 'd02', 'd03', 'd04', 'd05', 'd06', 'd07', 'd08', 'd09',
                     'd10', 'd11', 'd12', 'd13', 'd14', 'd15', 'd16', 'd17', 'd18',
                     'd19', 'd20', 'd21', 'd22', 'd23', 'd24', 'd25', 'd26', 'd27',
                     'd28', 'd29', 'd30', 'd31']
month_array = ['01', '02', '03', '04', '05', '06',
               '07', '08', '09', '10', '11', '12']
ru_month_array = ['Январь', 'Февраль', 'Март', 'Апрель',
                  'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь',
                  'Октябрь', 'Ноябрь', 'Декабрь']

groups_array = ['ААбз-18-1', 'ААбз-19-1', 'ААбз-20-1', 'ААбз-21-1', 'ААбз-22-1', 'АД-22-1', 'АДб-19-1', 'АДб-20-1',
                'АДб-21-1', 'АДбз-18-1', 'АДбз-19-1', 'АДбз-20-1', 'АДбз-21-1', 'АДм-21-1', 'АДм-22-1', 'АРб-18-1',
                'АРб-18-2', 'АРб-19-1', 'АРб-19-2', 'АРб-20-1', 'АРб-20-2', 'АРб-21-1', 'АРб-21-2', 'АРб-22-1',
                'АРб-22-2', 'АРбв-18-1', 'АСПм-22-1', 'АСУб-19-1', 'АСУб-20-1', 'АСУб-20-2', 'АСУб-21-1', 'АСУб-21-2',
                'АСУб-21-3', 'АСУб-22-1', 'АСУб-22-2', 'АСУбз-18-1', 'АСУбз-19-1', 'АСУбз-20-1', 'АСУбз-21-1',
                'АСУбз-22-1', 'АСУбз-22-2', 'АСб-19-1', 'АСб-20-1', 'АСб-21-1', 'АСб-22-1', 'АТМб-19-1', 'АТМб-20-1',
                'АТМб-21-1', 'АТПРб-22-1', 'АТПб-19-1', 'АТПб-20-1', 'АТПб-21-1', 'АТПб-22-1', 'АТПбз-19-1',
                'АТПбз-20-1', 'АТПбз-21-1', 'АТПбз-22-1', 'АТбз-18-1', 'АУДм-21-1', 'АУСм-21-1', 'АУСм-22-1',
                'БЖТбз-18-1', 'БЖТбз-19-1', 'БЖТбз-19-2', 'БЖТбз-20-1', 'БЖТбз-20-2', 'БЖТбз-21-1', 'БЖТбз-21-2',
                'БЖТбз-22-1', 'БЖТбз-22-2', 'БЖТм-21-1', 'БЖТм-22-1', 'БЖТмз-20-1', 'БЖТмз-21-1', 'БЖТмз-22-1',
                'БКСм-22-1', 'БПм-22-1', 'БТПб-19-1', 'БТПб-20-1', 'БТПб-21-1', 'БТПб-22-1', 'БТб-21-1', 'БТб-22-1',
                'ВВб-19-1', 'ВВб-20-1', 'ВВб-21-1', 'ВВб-22-1', 'ВВбз-18-1', 'ВВм-21-1', 'ВВм-22-1', 'ВДм-22-1',
                'ВДмз-21-1', 'ВДмз-22-1', 'ВЭАм-21-1', 'ГА-17-1', 'ГА-18-1', 'ГА-19-1', 'ГА-20-1', 'ГА-21-1', 'ГА-22-1',
                'ГАз-17-1', 'ГАз-19-1', 'ГГ-17-1', 'ГГ-18-1', 'ГГ-19-1', 'ГГ-20-1', 'ГГ-21-1', 'ГГ-22-1', 'ГГз-16-1',
                'ГГз-17-1', 'ГГз-18-1', 'ГГз-18-2', 'ГГз-19-1', 'ГГз-20-1', 'ГГз-21-1', 'ГГз-21-2', 'ГГз-22-1',
                'ГИС-18-1', 'ГИС-19-1', 'ГИС-20-1', 'ГМ-17-1', 'ГМ-18-1', 'ГМ-19-1', 'ГМ-20-1', 'ГМ-21-1', 'ГМ-22-1',
                'ГМФб-19-1', 'ГМз-16-1', 'ГМз-17-1', 'ГМз-18-1', 'ГМз-19-1', 'ГМз-20-1', 'ГМз-21-1', 'ГМз-22-1',
                'ГНДм-21-1', 'ГО-17-1', 'ГО-18-1', 'ГО-19-1', 'ГО-20-1', 'ГО-21-1', 'ГО-22-1', 'ГОз-16-1', 'ГОз-17-1',
                'ГОз-18-1', 'ГОз-19-1', 'ГОз-20-1', 'ГОз-21-1', 'ГОз-21-2', 'ГОз-22-1', 'ГП-17-1', 'ГП-18-1', 'ГП-19-1',
                'ГП-20-1', 'ГП-21-1', 'ГП-22-1', 'ГПз-16-1', 'ГПз-17-1', 'ГПз-18-1', 'ГПз-19-1', 'ГПз-20-1', 'ГПз-21-1',
                'ГПз-22-1', 'ГРб-18-1', 'ГРб-19-1', 'ГРб-19-2', 'ГРб-20-1', 'ГРб-20-2', 'ГРб-21-1', 'ГРб-21-2',
                'ГРб-22-1', 'ГРб-22-2', 'ГРм-21-1', 'ГРм-22-1', 'ГСХб-19-1', 'ГСХб-20-1', 'ГСХб-21-1', 'ГСХб-22-1',
                'ГСХбз-18-1', 'ГСХбз-18-2', 'ГСХбз-19-1', 'ГСХбз-20-1', 'ГСХбз-21-1', 'ГСХм-21-1', 'ГСХм-22-1',
                'ГЭ-22-1', 'ДИб-19-1', 'ДИб-20-1', 'ДИб-20-2', 'ДИб-21-1', 'ДИб-22-1', 'ДИб-22-2', 'ДИб-22-3',
                'ДСб-18-1', 'ДСб-19-1', 'ДСб-20-1', 'ДСб-21-1', 'ДСб-21-2', 'ДСб-22-1', 'ЖКб-20-1', 'ЖКб-21-1',
                'ЖКб-22-1', 'ЖРб-19-1', 'ЖРб-20-1', 'ЖРб-20-2', 'ЖРб-21-1', 'ЖРб-22-1', 'ЖРб-22-2', 'ЖРбз-19-1',
                'ИБб-19-1', 'ИБб-19-2', 'ИБб-20-1', 'ИБб-20-2', 'ИБб-21-1', 'ИБб-21-2', 'ИБб-22-1', 'ИБб-22-2',
                'ИГ-18-1', 'ИГ-19-1', 'ИГ-20-1', 'ИГ-21-1', 'ИГ-22-1', 'ИИКб-20-1', 'ИИКб-21-1', 'ИИКб-22-1',
                'ИИТм-21-1', 'ИИТм-22-1', 'ИИм-22-1', 'ИИмз-20-1', 'ИНС-19-1', 'ИНС-19-2', 'ИНС-20-1', 'ИНС-20-2',
                'ИНС-20-3', 'ИНС-20-4', 'ИНС-21-1', 'ИНС-21-2', 'ИНС-22-1', 'ИНС-22-2', 'ИНСм-21-1', 'ИНСм-22-1',
                'ИНб-19-1', 'ИНб-20-1', 'ИРТм-22-1', 'ИРТмз-21-1', 'ИРб-21-1', 'ИРб-22-1', 'ИРбз-21-1', 'ИСИб-22-1',
                'ИСМб-19-1', 'ИСТб-19-1', 'ИСТб-19-2', 'ИСТб-20-1', 'ИСТб-20-2', 'ИСТб-20-3', 'ИСТб-21-1', 'ИСТб-21-2',
                'ИСТб-21-3', 'ИСТб-22-1', 'ИСТб-22-2', 'ИСТб-22-3', 'ИТНм-21-1', 'ИФб-19-1', 'ИФб-20-1', 'ИФб-21-1',
                'ИФб-22-1', 'ИЭб-19-1', 'ИЭб-20-1', 'ИЭб-21-1', 'ИЭм-21-1', 'ИЭм-22-1', 'КНб-19-1', 'КНб-20-1',
                'КНб-21-1', 'КНб-22-1', 'КНбз-18-1', 'КНбз-19-1', 'КНбз-20-1', 'КНбз-21-1', 'КНбз-22-1', 'КСм-21-1',
                'КСм-22-1', 'КСм-22-2', 'КТЭм-21-1', 'КТЭм-22-1', 'КТбз-18-1', 'КТбз-18-2', 'КТбз-19-1', 'КТбз-20-1',
                'КТбз-20-2', 'КТбз-21-1', 'КТбз-22-1', 'ЛБКб-22-1', 'ЛИМб-19-1', 'ЛИМб-20-1', 'ЛИМб-21-1', 'ЛИМб-22-1',
                'ЛИМбз-21-1', 'ЛИМбз-22-1', 'ЛМБм-21-1', 'ЛМБм-22-1', 'МБб-19-1', 'МБб-20-1', 'МБб-21-1', 'МБб-21-2',
                'МБб-22-1', 'МД-17-1', 'МД-18-1', 'МД-20-1', 'МД-21-1', 'МД-22-1', 'МДБб-19-1', 'МДБб-19-2',
                'МДБб-20-1', 'МДБб-21-1', 'МДБб-22-1', 'МИРб-19-1', 'МИРб-20-1', 'МИРб-21-1', 'МИРб-22-1', 'ММб-19-1',
                'ММб-20-1', 'ММб-20-2', 'ММб-21-1', 'ММб-22-1', 'ММб-22-2', 'МОТУм-22-1', 'МТб-19-1', 'МТб-20-1',
                'МТб-21-1', 'МТб-22-1', 'МТбз-18-1', 'МТбз-19-1', 'МТбз-20-1', 'МТбз-21-1', 'МТбз-22-1', 'МЦб-19-1',
                'МЦб-20-1', 'МЦб-21-1', 'МЦб-22-1', 'МЦбз-18-1', 'МЦбз-19-1', 'МЦбз-20-1', 'МЦбз-21-1', 'МЦбз-22-1',
                'МЦбз-22-2', 'МЦм-21-1', 'МЦм-22-1', 'МЭбз-18-1', 'НБ-20-1', 'НБ-21-1', 'НБ-21-2', 'НБ-22-1', 'НБ-22-2',
                'НБ-22-3', 'НБз-20-1', 'НБз-20-2', 'НБз-21-1', 'НБз-22-1', 'НБз-22-2', 'НГДДСз-22-1', 'НГДДСз-22-2',
                'НГДСз-19-1', 'НГДСз-19-2', 'НГДСз-19-3', 'НГДСз-20-1', 'НГДСз-20-2', 'НГДСз-21-1', 'НГДСз-21-2',
                'НГДСз-21-3', 'НГДСз-21-4', 'НГДСз-22-1', 'НГДСз-22-2', 'НГДСз-22-3', 'НДДб-19-1', 'НДДб-19-2',
                'НДДб-20-1', 'НДДб-21-1', 'НДДб-21-2', 'НДДб-22-1', 'НДДбз-18-1', 'НДДбз-18-2', 'НДДбз-18-3',
                'НДб-19-1', 'НДб-19-2', 'НДб-20-1', 'НДб-20-2', 'НДб-21-1', 'НДб-21-2', 'НДб-22-1', 'НДб-22-2',
                'НДб-22-3', 'НДбз-18-1', 'НДбз-18-2', 'НДм-21-1', 'НДм-22-1', 'НМб-19-1', 'НМб-20-1', 'НМб-21-1',
                'НМб-22-1', 'НТСм-21-1', 'НТСм-22-1', 'ООСб-19-1', 'ООСб-21-1', 'ООСб-22-1', 'ОП-17-1', 'ОП-18-1',
                'ОП-19-1', 'ОП-20-1', 'ОП-21-1', 'ОП-22-1', 'ОПз-21-1', 'ОПз-22-1', 'ОТКм-21-1', 'ОТКм-22-1',
                'ОХПм-21-1', 'ОХПм-22-1', 'ПБм-21-1', 'ПБм-22-1', 'ПБмз-20-1', 'ПБмз-20-2', 'ПБмз-21-1', 'ПБмз-22-1',
                'ПГСб-19-1', 'ПГСб-19-2', 'ПГСб-20-1', 'ПГСб-21-1', 'ПГСб-22-1', 'ПГСбз-18-1', 'ПГСбз-18-2',
                'ПГСбз-19-1', 'ПГСбз-20-1', 'ПГСбз-21-1', 'ПГСбз-21-2', 'ПГСбз-21-3', 'ПИм-21-1', 'ПИм-22-1',
                'ПМб-19-1', 'ПМб-20-1', 'ПМбз-19-1', 'ПМм-22-1', 'ПОм-21-1', 'ППТм-21-1', 'ППТм-22-1', 'ПРЭм-21-1',
                'ПСУм-21-1', 'ПСУм-22-1', 'РГ-19-1', 'РГ-21-1', 'РДб-19-1', 'РДб-20-1', 'РДб-21-1', 'РДб-22-1',
                'РДбз-18-1', 'РДбз-19-1', 'РДбз-20-1', 'РДбз-21-1', 'РДбз-22-1', 'РМ-18-1', 'РМ-20-1', 'РМ-22-1',
                'РРб-19-1', 'РРб-20-1', 'РРб-22-1', 'РРбп-18-1', 'РТУм-22-1', 'РТз-17-1', 'РТз-18-1', 'РТз-19-1',
                'РТз-22-1', 'РФ-18-1', 'РФ-19-1', 'РФ-20-1', 'РФ-21-1', 'РФ-22-1', 'СДМ-18-1', 'СДМ-19-1', 'СДМ-20-1',
                'СДМ-21-1', 'СДМз-17-1', 'СДМз-18-1', 'СДМз-19-1', 'СДМз-20-1', 'СДМз-21-1', 'СДМз-22-1', 'СМ-17-1',
                'СМ-17-2', 'СМ-18-1', 'СМ-18-2', 'СМ-19-1', 'СМ-19-2', 'СМ-20-1', 'СМ-20-2', 'СМ-21-1', 'СМ-21-2',
                'СМ-22-1', 'СМ-22-2', 'СМТм-21-1', 'СМТм-22-1', 'СМз-16-1', 'СМз-16-2', 'СМз-17-1', 'СМз-17-2',
                'СМз-17-3', 'СМз-18-1', 'СМз-18-2', 'СМз-19-1', 'СМз-20-1', 'СНГб-22-1', 'СПРКм-21-1', 'СПм-21-1',
                'СРбз-18-1', 'СРбз-19-1', 'ССЭм-21-1', 'ССЭм-22-1', 'СТЭб-22-1', 'СТЭб-22-2', 'СТЭбз-22-1', 'СУЗ-17-1',
                'СУЗ-18-1', 'СУЗ-19-1', 'СУЗ-20-1', 'СУЗ-21-1', 'СУЗ-22-1', 'СЭм-21-1', 'ТВб-19-1', 'ТВб-20-1',
                'ТВб-21-1', 'ТВбз-19-1', 'ТГВм-21-1', 'ТГВм-22-1', 'ТИМм-21-1', 'ТИМм-22-1', 'ТПб-19-1', 'ТПб-20-1',
                'ТПб-21-1', 'ТПб-22-1', 'ТПбз-18-1', 'ТПбз-20-1', 'ТПбз-21-1', 'ТПбз-22-1', 'ТХб-19-1', 'ТХб-19-2',
                'ТХб-20-1', 'ТХб-21-1', 'ТХб-22-1', 'ТХб-22-2', 'ТЭАм-21-1', 'ТЭАм-22-1', 'ТЭбз-18-1', 'ТЭбз-19-1',
                'ТЭбз-20-1', 'ТЭбз-21-1', 'УКб-19-1', 'УКб-20-1', 'УКб-21-1', 'УКб-22-1', 'УЛм-21-1', 'УЛм-22-1',
                'УОБТб-22-1', 'УОБТб-22-2', 'УПКм-22-1', 'УПб-19-1', 'УПб-21-1', 'УПб-21-2', 'УПбз-18-1', 'УПбз-18-2',
                'УПбз-20-1', 'УСТб-19-1', 'УСТб-20-1', 'УСТб-21-1', 'УСТб-22-1', 'УСТм-21-1', 'УСТм-22-1', 'УСТмз-21-1',
                'УСТмз-22-1', 'УТСбз-18-1', 'УТСбз-19-1', 'УТСбз-20-1', 'УЭСм-21-1', 'УЭСм-22-1', 'ФКб-19-1',
                'ФКб-20-1', 'ФКб-20-2', 'ФКб-21-1', 'ФКб-21-2', 'ФКб-22-1', 'ФКб-22-2', 'ФКбз-18-1', 'ФКбз-19-1',
                'ФКбз-20-1', 'ФНб-22-1', 'ФХм-22-1', 'ХТОб-19-1', 'ХТОб-20-1', 'ХТОб-21-1', 'ХТОб-22-1', 'ХТТб-19-1',
                'ХТТб-20-1', 'ХТТб-21-1', 'ХТТб-22-1', 'ХТбз-18-1', 'ХТбз-19-1', 'ХТбз-20-1', 'ХТбз-21-1', 'ХТбз-22-1',
                'ХТм-21-1', 'ХТм-22-1', 'ЦИСм-21-1', 'ЦИСм-22-1', 'ЦТРб-22-1', 'ЦТм-21-1', 'ЦТм-22-1', 'ЦЭм-21-1',
                'ЦЭм-22-1', 'ЭАПЭб-21-1', 'ЭАПЭб-22-1', 'ЭАПЭбз-22-1', 'ЭАПб-19-1', 'ЭАПб-20-1', 'ЭВБм-21-1',
                'ЭВМб-19-1', 'ЭВМб-20-1', 'ЭВМб-21-1', 'ЭВМб-21-2', 'ЭВМб-22-1', 'ЭВМб-22-2', 'ЭВМбз-18-1',
                'ЭВМбз-19-1', 'ЭВМбз-20-1', 'ЭВМбз-21-1', 'ЭВМбз-22-1', 'ЭЗИмз-21-1', 'ЭИб-19-1', 'ЭИб-20-1',
                'ЭКОм-21-1', 'ЭКОм-22-1', 'ЭКОмз-20-1', 'ЭКОмз-21-1', 'ЭКОмз-22-1', 'ЭЛб-19-1', 'ЭЛб-20-1', 'ЭЛб-21-1',
                'ЭЛб-22-1', 'ЭЛбз-18-1', 'ЭЛбз-19-1', 'ЭЛбз-20-1', 'ЭЛбз-21-1', 'ЭЛбз-22-1', 'ЭМЭНм-21-1',
                'ЭМЭНмз-20-1', 'ЭМЭНмз-21-1', 'ЭМЭНмз-22-1', 'ЭНГм-21-1', 'ЭНГм-22-1', 'ЭПАб-21-1', 'ЭПАб-22-1',
                'ЭПОб-19-1', 'ЭПОб-20-1', 'ЭПОб-21-1', 'ЭПОбз-18-1', 'ЭПОбз-19-1', 'ЭПЭБ-20-1', 'ЭПЭБ-20-2',
                'ЭПЭБ-21-1', 'ЭПЭБ-21-2', 'ЭПЭБ-22-1', 'ЭПЭБ-22-2', 'ЭПЭБз-20-1', 'ЭПЭБз-21-1', 'ЭПЭБз-21-2',
                'ЭПЭБз-22-1', 'ЭПЭБз-22-2', 'ЭПб-19-1', 'ЭПб-20-1', 'ЭПб-21-1', 'ЭПб-22-1', 'ЭПбз-18-1', 'ЭПбз-18-2',
                'ЭПбз-19-1', 'ЭПбз-19-2', 'ЭПбз-20-1', 'ЭПбз-20-2', 'ЭПбз-21-1', 'ЭПбз-21-2', 'ЭПбз-22-1', 'ЭПмз-20-1',
                'ЭПмз-21-1', 'ЭПмз-22-1', 'ЭСТб-19-1', 'ЭСТб-20-1', 'ЭСТб-21-1', 'ЭСТб-21-2', 'ЭСТм-21-1', 'ЭСТм-22-1',
                'ЭСб-19-1', 'ЭСб-19-2', 'ЭСб-20-1', 'ЭСб-20-2', 'ЭСб-21-1', 'ЭСб-21-2', 'ЭСб-22-1', 'ЭСб-22-2',
                'ЭСбз-18-1', 'ЭСбз-19-1', 'ЭСбз-20-1', 'ЭСбз-21-1', 'ЭСбз-22-1', 'ЭСм-21-1', 'ЭСм-22-1', 'ЭТЭКб-19-1',
                'ЭУМБм-21-1', 'ЭУНб-19-1', 'ЭУНб-20-1', 'ЭУНб-21-1', 'ЭУНб-22-1', 'ЭУНбз-18-1', 'ЭУм-21-1', 'ЭУм-22-1',
                'ЭУмз-20-1', 'ЭУмз-21-1', 'ЭУмз-22-1', 'ЮРГб-19-1', 'ЮРГб-19-2', 'ЮРГб-20-1', 'ЮРГб-21-1', 'ЮРГб-21-2',
                'ЮРГбв-18-1', 'ЮРГбв-19-1', 'ЮРУб-19-1', 'ЮРУб-19-2', 'ЮРУб-20-1', 'ЮРУб-20-2', 'ЮРУб-21-1',
                'ЮРУб-21-2', 'ЮРУб-22-1', 'ЮРУб-22-2', 'ЮРУб-22-3', 'ЮРУб-22-4', 'аАГП-20-1', 'аАГП-21-1', 'аАГПз-19-1',
                'аАТИ-21-1', 'аАТП-19-1', 'аАТП-20-1', 'аАТП-21-1', 'аАУП-22-1', 'аБЗТ-22-1', 'аБПП-22-1', 'аБТ-20-1',
                'аВДС-22-1', 'аВК-20-1', 'аВК-21-1', 'аГГМ-22-1', 'аГИС-21-1', 'аГКЛ-22-1', 'аГКкг-22-1', 'аГМ-19-1',
                'аГМ-20-1', 'аГМ-21-1', 'аГНП-22-1', 'аГТ-19-1', 'аГТ-20-1', 'аГТ-21-1', 'аГЭ-20-1', 'аДВЛ-22-1',
                'аДЛА-19-1', 'аДЛА-20-1', 'аДЛА-21-1', 'аДПМ-20-1', 'аДСМ-19-1', 'аДСМ-20-1', 'аДСМ-21-1', 'аИНС-22-1',
                'аИНТз-21-1', 'аИСНТ-22-1', 'аМ-19-1', 'аМ-21-1', 'аМВ-22-1', 'аМЕТ-22-1', 'аММ-19-1', 'аММ-20-1',
                'аММ-21-1', 'аММП-22-1', 'аМН-22-1', 'аМЦМ-19-1', 'аМЦМ-20-1', 'аМЦМ-21-1', 'аНСдсм-22-1',
                'аНСкгм-22-1', 'аОБП-22-1', 'аОПИ-19-1', 'аОПИ-20-1', 'аОПИ-21-1', 'аОТ-19-1', 'аОТ-20-1', 'аОТз-19-1',
                'аОХ-20-1', 'аПМФ-22-1', 'аПМЭФ-20-1', 'аПМЭФ-21-1', 'аППН-22-1', 'аРОТ-20-1', 'аРОТ-21-1', 'аРТХ-22-1',
                'аРЭ-22-1', 'аСМ-19-1', 'аСМ-20-1', 'аСМ-21-1', 'аСМХ-22-1', 'аСМз-21-1', 'аСОЦ-20-1', 'аСТМ-22-1',
                'аТАРР-22-1', 'аТВ-20-1', 'аТВ-21-1', 'аТГР-19-1', 'аТГР-21-1', 'аТМ-19-1', 'аТМ-20-1', 'аТМ-21-1',
                'аТМД-22-1', 'аТМН-22-1', 'аТОВ-20-1', 'аТОВ-21-1', 'аТОС-22-1', 'аТПК-19-1', 'аТПК-20-1', 'аТПК-21-1',
                'аТПС-22-1', 'аТПСК-22-1', 'аТС-19-1', 'аТС-20-1', 'аТС-21-1', 'аТТГР-22-1', 'аТФ-21-1', 'аТФЗ-22-1',
                'аТХВ-22-1', 'аТХП-21-1', 'аУИ-20-1', 'аУИ-21-1', 'аУИз-19-1', 'аУКП-19-1', 'аУКП-20-1', 'аУКП-21-1',
                'аУППоп-22-1', 'аУППс-22-1', 'аФКз-19-1', 'аФХ-19-1', 'аФХ-20-1', 'аХТВ-22-1', 'аХТТ-19-1', 'аХТТ-21-1',
                'аХТТз-19-1', 'аЭАТД-19-1', 'аЭАТД-20-1', 'аЭАТД-21-1', 'аЭАТО-19-1', 'аЭАТО-20-1', 'аЭАТО-21-1',
                'аЭК-20-1', 'аЭК-21-1', 'аЭКЛ-22-1', 'аЭКС-22-1', 'аЭНК-22-1', 'аЭСК-19-1', 'аЭСК-20-1', 'аЭСК-21-1',
                'аЭСКз-20-1', 'аЭТК-20-1', 'аЭТК-21-1', 'аЭТКз-18-1', 'аЭТРд-22-1', 'аЭТРоп-22-1', 'аЭУП-21-1',
                'аЭУПз-19-1', 'аЭУПз-21-1', 'аЭЭН-22-1', 'аЭЭС-19-1', 'аЭЭС-20-1', 'аЭЭС-21-1', 'аЮРКз-21-1',
                'аЮРФз-20-1', 'аЮРФз-21-1', 'аЮРз-19-1']

main_admin = 545762112

admins = DB.take_dictionary('admins', current_month, current_year)
users = DB.take_dictionary('users', current_month, current_year)

# Курс 1
# ИЭм-22-1 КТЭм-22-1 МОТУм-22-1 СТЭб-22-1 СТЭб-22-2 УЭСм-22-1 ЦЭм-22-1 ЭАПЭб-22-1 ЭНГм-22-1 ЭПб-22-1 ЭПмз-22-1 ЭСТм-22-1 ЭСб-22-1 ЭСб-22-2 ЭСм-22-1 ЭУм-22-1 ЭУмз-22-1
# Курс 2
# ИЭм-21-1 КТЭм-21-1 ПРЭм-21-1 СЭм-21-1 УЭСм-21-1 ЦЭм-21-1 ЭАПЭб-21-1 ЭНГм-21-1 ЭПб-21-1 ЭПмз-21-1 ЭСТб-21-1 ЭСТб-21-2 ЭСТм-21-1 ЭСб-21-1 ЭСб-21-2 ЭСм-21-1 ЭУм-21-1 ЭУмз-21-1
# Курс 3
# ЭАПб-20-1 ЭПб-20-1 ЭПмз-20-1 ЭСТб-20-1 ЭСб-20-1 ЭСб-20-2 ЭУмз-20-1
# Курс 4
# ЭАПб-19-1 ЭПб-19-1 ЭСТб-19-1 ЭСб-19-1 ЭСб-19-2
